blackburnd/esp32_office_controller/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# Use custom partition table with 2MB app partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y

CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_LOG=n
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=y

CONFIG_ESP_TLS_USING_WOLFSSL=n
CONFIG_ESP_TLS_USING_MBEDTLS=y
# Ensure secure TLS certificate verification (do not skip)
CONFIG_ESP_TLS_INSECURE=n
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=n

# --- Memory tweaks: prefer PSRAM and shrink TLS buffers ---
# Allow malloc() to use external PSRAM (already true in current sdkconfig, keep here as default)
CONFIG_SPIRAM_USE_MALLOC=y
# Keep a small internal allocation threshold; larger blocks go to PSRAM
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# Reserve some internal memory for DMA/internal needs
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# Try to place WiFi/LWIP buffers into PSRAM to free internal RAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# TLS buffer sizes - increased IN buffer to 32KB for large responses (OpenWeatherMap forecast)
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=32768
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set
# CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH is not set
# Optional: don't keep peer certificate after handshake to save RAM
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# --- Office Controller Configuration ---
# Camera snapshot URL
CONFIG_CAMERA_SNAPSHOT_URL="http://192.168.1.115/cgi-bin/api.cgi?cmd=Snap&channel=1&user=danielb&password=plastic12&width=320&height=240"
# Home Assistant configuration
CONFIG_HA_BASE_URL="http://192.168.1.206:8123"
CONFIG_HA_ACCESS_TOKEN="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiIyZjI0M2Y3YzZjNDY0Y2ExOTk4YWIzYTM2NDdmMTNkYyIsImlhdCI6MTc1OTk0MzM0MiwiZXhwIjoyMDc1MzAzMzQyfQ.CywPwRlHLE9Oilufp_iRjSByLAjn6huRtx0Omk7vGyE"
# OpenWeatherMap API key
CONFIG_OPENWEATHER_API_KEY="f629bfa41962d9cfb3842b40d2ca7a5c"